INJ_WEB_PROXY/run 1/wrk_via_waf_c500_t4_200s_run1.txt
Running 3m test @ http://10.0.2.1/
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.02ms   25.84ms 219.94ms   81.86%
    Req/Sec     7.52k   606.66    10.02k    70.91%
  Latency Distribution
     50%   10.11ms
     75%   40.83ms
     90%   62.88ms
     99%   99.36ms
  5984569 requests in 3.33m, 1.38GB read
  Socket errors: connect 0, read 1160281, write 0, timeout 0
  Non-2xx or 3xx responses: 251
Requests/sec:  29921.21
Transfer/sec:      7.08MB